# 06 Use of Index

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('http://bit.ly/uforeports')
# data.to_csv('../data/uforeports.csv')
data.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [3]:
data.index

RangeIndex(start=0, stop=18241, step=1)

In [4]:
data.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

In [5]:
data[data.State == 'NY']

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00
41,New York City,NaN,DISK,NY,1/8/1946 2:00
50,Syracuse,NaN,DISK,NY,2/20/1947 22:15
74,Syracuse,NaN,CIGAR,NY,7/14/1947 10:30
...,...,...,...,...,...
18073,Monticello,NaN,TRIANGLE,NY,12/4/2000 14:00
18077,North Tonawanda,NaN,OTHER,NY,12/4/2000 21:40
18086,Tonawanda,NaN,LIGHT,NY,12/6/2000 4:55
18126,New York City,NaN,VARIOUS,NY,12/15/2000 16:20
18189,Buffalo,NaN,FORMATION,NY,12/25/2000 18:30

In [6]:
data.shape

(18241, 5)

In [7]:
data.loc[0, 'State']

'NY'

In [8]:
data.set_index('City', inplace=True)

In [9]:
data.head()

                     Colors Reported Shape Reported State             Time
City
Ithaca                           NaN       TRIANGLE    NY   6/1/1930 22:00
Willingboro                      NaN          OTHER    NJ  6/30/1930 20:00
Holyoke                          NaN           OVAL    CO  2/15/1931 14:00
Abilene                          NaN           DISK    KS   6/1/1931 13:00
New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [10]:
data.shape

(18241, 4)

In [11]:
data.loc['Abilene', 'Colors Reported']

City
Abilene    NaN
Abilene    NaN
Abilene    NaN
Abilene    NaN
Abilene    NaN
Name: Colors Reported, dtype: object